{
  "name": "mvweb-data-export",
  "version": "1.0.0",
  "download_url": "https://raw.githubusercontent.com/ViMV9/mvweb-updates/main/plugins/mvweb-data-export/mvweb-data-export-1.0.0.zip",
  "requires": "6.6",
  "tested": "6.7",
  "requires_php": "8.0",
  "author": "MVweb",
  "author_homepage": "https://mvweb.ru",
  "homepage": "https://mvweb.ru/plugins/mvweb-data-export",
  "last_updated": "2026-02-08 18:23:22",
  "sections": {
    "changelog": "<h4>Added</h4>\n<ul>\n<li>Plugin scaffolding: entry point, constants, shared components (Menu, Updater, PUC).</li>\n<li>Admin page with 5 tabs (Export, Presets, History, Settings, Help).</li>\n<li>Help tab with Quick Start, Features, FAQ, and Support sections.</li>\n<li>Settings tab: encoding, header language, batch size, max records, max history, delete on uninstall.</li>\n<li>System information block: PHP limits, disk space, export directory status, WooCommerce status.</li>\n<li>AJAX handler for saving settings with validation.</li>\n<li>File manager: export directory creation, .htaccess protection, index.php, Nginx detection with admin notice.</li>\n<li>Tab switching with localStorage persistence.</li>\n<li>Inline notifications system.</li>\n<li>CSS with BEM methodology and brand color (#793ea4).</li>\n<li>Build system: terser + clean-css minification.</li>\n<li>Field registry: dynamic field discovery for post types and taxonomies with transient caching.</li>\n<li>CSV/TXT writer with UTF-8 BOM support, semicolon/tab delimiters.</li>\n<li>Streaming write API in CSV Writer (`open_for_append`, `write_single_row`, `write_rows`, `close`).</li>\n<li>Cursor-based pagination for ID-sorted exports (avoids slow OFFSET on large tables).</li>\n<li>Exporter: WP_Query-based batch processing with memory monitoring and cache preloading.</li>\n<li>AJAX export flow: start, batch, cancel, download with session management and user locking.</li>\n<li>Drag-n-drop field selection with jQuery UI Sortable (available/selected lists).</li>\n<li>Progress bar with percentage counter and cancel button.</li>\n<li>Download via hidden iframe with IDOR protection and path traversal prevention.</li>\n<li>Export history with FIFO rotation stored in wp_options.</li>\n<li>Filters: post status (multiselect), taxonomy terms, date range, author dropdown.</li>\n<li>Dynamic filter loading via AJAX on source change.</li>\n<li>Preview: display first 10 rows in scrollable table before export.</li>\n<li>Permissions model: admins see all, editors see published + own posts of any status.</li>\n<li>Cancel export with confirmation dialog and temporary file cleanup.</li>\n<li>Preset manager: CRUD for export presets with per-user limits (max 20) and IDOR protection.</li>\n<li>Preset bar on Export tab: dropdown, Load, Save as Preset controls.</li>\n<li>Presets tab: full table UI with lazy-loading, load/delete actions.</li>\n<li>History tab: full table UI with lazy-loading, download links, delete actions.</li>\n<li>AJAX endpoints: save_preset, delete_preset, get_presets, get_history, delete_history.</li>\n<li>Preset restoration: export type, source, fields, format, filters applied on load.</li>\n<li>Migrated CSS to MVweb UI Kit Classic Clean (global variables, components).</li>\n<li>Preset manager saves `variation_mode` and sanitizes WC-specific filters (price, stock status, product type).</li>\n<li>Export batch handler returns file write errors to client via `error` key in response.</li>\n</ul>"
  }
}